# -*- coding: Windows-1251 -*-
start_message = "Привет. Перед тобою телеграм бот направления математика, информатика и инженерия лицея НИУ ВШЭ.\nС его помощью ты сможешь получить актуальную информацию про направление.\nЕсли понадобится подробный список команд воспользуйся командой /help. А теперь предлагаю пройти регистрацию для более удобной работы с ботом."

error_message = "Упс, произошла ошибка. Повторите запрос или вернитесь позже."

registration_undone = "Регистрация не пройдена!"

ivr_info = "ivr_info"

places_info = "places_info"

groups_info = "groups_info"

help_message = "ААА ПАМАГИТЕ"
