# -*- coding: Windows-1251 -*-
math = ["Максимова О.В.", "Показеев В.В", "Бородина С.И.",
        "Золотухина А.Ф.", "Шабат Н.А.", "Салимова А.Ф.",
        "Надыршин Т.Р.", "Тобенгауз А.М.", "Мотиенко Д.М.",
        "Быков Ю.В.", "Андросова А.Ф."]
english = ["Купцов А.А.", "Расщепляева А.И.", "Бабаян Т.М.",
           "Белая Е.В.", "Рычкова С.А.", "Крючкова М.А.",
           "Салехова Л.Ю.", "Воронкова А.В.", "Николаева О.С"]
rus = ["Задорожная А.С.", "Астафьева И.Ю.", "Юганова Ф.С.",
       "Гордиенко О.А.", "Бауэр А.В."]
lit = ["Задорожная А.С.", "Кубрик А.А.", "Юганова Ф.С.",
       "Гордиенко О.А.", "Борисов К.О.", "Тимошенко Е.К."]
tok = ["Бессчетнова Е.В.", "Ермишина К.В.", "Гиринский А.А.",
       "Беляева А.В.", "Шешенин Р.К."]
teor_inf = ["Борискина Ю.М.", "Салимов Д.Р.", "Глушкова Н.Н."]
prog = ["Куренков В.В.", "Куренкова Т.В", "Лесовская И.Н.",
        "Стрельцов М.А."]
inf = ["Широков А.И."]
pk = ["Куренков В.В.", "Глушкова Н.Н.", "Копытова Н.В.",
      "Меликян А.В.", "Широков А.И.", "Куренкова Т.В."]
history = ["Донской Г.Г.", "Московцева Ж.Ю.", "Морозов О.В.",
           "Ильин А.А.", "Маслакова Т.П.", "Тепляков А.Ю."]
physical_education = ["Сорокина П.П.", "Голубев Е.В."]
physics = ["Тюшагин В.Н.", "Строганкова Н.И.", "Быков С.Д.",
           "Карпутин В.С.", "Красникова Ю.В.", "Строганкова Н.И.",
           "Коротова И.А."]
all_teachers = ["Максимова О.В.", "Показеев В.В", "Бородина С.И.",
                "Золотухина А.Ф.", "Шабат Н.А.", "Салимова А.Ф.",
                "Надыршин Т.Р.", "Тобенгауз А.М.", "Мотиенко Д.М.",
                "Быков Ю.В.", "Андросова А.Ф.", "Купцов А.А.", "Расщепляева А.И.",
                "Бабаян Т.М.", "Белая Е.В.", "Рычкова С.А.", "Крючкова М.А.",
                "Салехова Л.Ю.", "Воронкова А.В.", "Николаева О.С", "Задорожная А.С.",
                "Астафьева И.Ю.", "Юганова Ф.С.", "Гордиенко О.А.", "Бауэр А.В.",
                "Кубрик А.А.", "Борисов К.О.", "Тимошенко Е.К.", "Бессчетнова Е.В.",
                "Ермишина К.В.", "Гиринский А.А.", "Беляева А.В.", "Шешенин Р.К.", "Донской Г.Г.",
                "Московцева Ж.Ю.", "Морозов О.В.", "Ильин А.А.", "Маслакова Т.П.", "Тепляков А.Ю.",
                "Сорокина П.П.", "Голубев Е.В.", "Тюшагин В.Н.", "Строганкова Н.И.", "Быков С.Д.",
                "Карпутин В.С.", "Красникова Ю.В.", "Строганкова Н.И.", "Коротова И.А.",
                "Борискина Ю.М.", "Салимов Д.Р.", "Глушкова Н.Н.", "Куренков В.В.", "Куренкова Т.В",
                "Лесовская И.Н.", "Стрельцов М.А.", "Широков А.И.", "Меликян А.В.", "Копытова Н.В."]

subjects = {
    "Русский язык": rus,
    "Математика": math,
    "Английский язык": english,
    "Литература": lit,
    "Физика": physics,
    "ТОК": tok,
    "Теоретическая информатика": teor_inf,
    "Программирование": prog,
    "Базовая информатика": inf,
    "Пользовательский курс": pk,
    "Физкультура": physical_education
}
