# -*- coding: Windows-1251 -*-
start_message = "Привет. Перед тобою телеграм бот направления математика, информатика и инженерия лицея НИУ ВШЭ.\nС его помощью ты сможешь получить актуальную информацию про направление.\nЕсли понадобится подробный список команд воспользуйся командой /help."

teachers_texts = {
    'Максимова О.В.': '',
    'Показеев В.В': '',
    'Бородина С.И.': '',
    'Золотухина А.Ф.': '',
    'Шабат Н.А.': '',
    'Салимова А.Ф.': '',
    'Надыршин Т.Р.': '',
    'Тобенгауз А.М.': '',
    'Мотиенко Д.М.': '',
    'Быков Ю.В.': '',
    'Андросова А.Ф.': '',
    'Купцов А.А.': '',
    'Расщепляева А.И.': '',
    'Бабаян Т.М.': '',
    'Белая Е.В.': '',
    'Рычкова С.А.': '',
    'Крючкова М.А.': '',
    'Салехова Л.Ю.': '',
    'Воронкова А.В.': '',
    'Николаева О.С': '',
    'Задорожная А.С.': '',
    'Астафьева И.Ю.': '',
    'Юганова Ф.С.': '',
    'Гордиенко О.А.': '',
    'Бауэр А.В.': '',
    'Кубрик А.А.': '',
    'Борисов К.О.': '',
    'Тимошенко Е.К.': '',
    'Бессчетнова Е.В.': '',
    'Ермишина К.В.': '',
    'Гиринский А.А.': '',
    'Беляева А.В.': '',
    'Шешенин Р.К.': '',
    'Донской Г.Г.': '',
    'Московцева Ж.Ю.': '',
    'Морозов О.В.': '',
    'Ильин А.А.': '',
    'Маслакова Т.П.': '',
    'Тепляков А.Ю.': '',
    'Сорокина П.П.': '',
    'Голубев Е.В.': '',
    'Тюшагин В.Н.': '',
    'Строганкова Н.И.': '',
    'Быков С.Д.': '',
    'Карпутин В.С.': '',
    'Красникова Ю.В.': '',
    'Коротова И.А.': '',
    'Борискина Ю.М.': '',
    'Салимов Д.Р.': '',
    'Глушкова Н.Н.': '',
    'Куренков В.В.': '',
    'Куренкова Т.В.': '',
    'Лесовская И.Н.': '',
    'Стрельцов М.А.': '',
    'Широков А.И.': '',
    'Меликян А.В.': '',
    'Копытова Н.В.': '',
    'Хазова А.Б.': '',
    'Воронин С.А.': '',
    'Грачев Н.Н.': '',
    'Бонецкая О.А.': '',
    'Нестеренко Л.В.': '',
    'Кудренко Л.А.': '',
    'Гребнев Н.А.': '',
    'Жмуренко Л.А.': '',
    'Кадимова Р.Н.': ''
}

ivr_info = ""

places_info = ""

groups_info = ""

miem_info = ""

kompling_info = ""

bi_info = ""

matfak_info = ""

physfak_info = ""

fkn_info = ""

help_message = "Список команд:\n/changeclass - изменение параметров класса\n/editclass - редактирование параметров внутри класса\n" \
               "/timetable - получение расписания\n/teachers - получение информации об учителе\n/make_announce 'текст' - " \
               "отправка на рассмотрение модераторам вашего объявления\n/announce - включение/выключение рассылок\n" \
               "/ivr - информация об ИВР\n/groups - информация о соц.проектах лицея\n/fd - информация про факультетский день\n" \
               "/places - информация о полезных местах возле здания лицея на Солянке\n" \
               "'текст' - поиск по вашему запросу"

all_texts = [ivr_info, places_info, groups_info, miem_info, matfak_info, kompling_info, bi_info, physfak_info, fkn_info]
